app/views/orders/index.html.erb

                      order_path(order), :class => 'btn btn-mini btn-success' %>
          <% if order.order_items.present? %>
---
SELECT "orders".* FROM "orders"