app/controllers/orders_controller.rb

  def create
    @order = Order.new(params[:order])

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("closed_at", "created_at", "discount", "table_id", "total", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["closed_at", nil], ["created_at", Wed, 28 Aug 2013 14:28:49 UTC +00:00], ["discount", nil], ["table_id", 1], ["total", nil], ["updated_at", Wed, 28 Aug 2013 14:28:49 UTC +00:00]]