app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "description", "name", "price", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Thu, 27 Feb 2014 16:17:43 UTC +00:00], ["description", nil], ["name", "MyString"], ["price", nil], ["updated_at", Thu, 27 Feb 2014 16:17:43 UTC +00:00]]
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", "9"]]
---
  def update
    @product = Product.find(params[:id])