app/controllers/tables_controller.rb

SELECT "tables".* FROM "tables"
---
  def index
    @tables = Table.all

SELECT "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "orders".* FROM "orders" WHERE "orders"."table_id" = 1 AND "orders"."closed_at" IS NULL LIMIT 1
---
  def show
    @table = Table.find(params[:id])
    @order = Order.where(:table_id => @table.id, :closed_at => nil).first

SELECT "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT 1  [["id", "9"]]
---
  def edit
    @table = Table.find(params[:id])

INSERT INTO "tables" ("created_at", "name", "seats", "status", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Mon, 26 Aug 2013 14:51:36 UTC +00:00], ["name", "MyString"], ["seats", nil], ["status", nil], ["updated_at", Mon, 26 Aug 2013 14:51:36 UTC +00:00]]
---
  def create
    @table = Table.new(params[:table])

    respond_to do |format|
      if @table.save

SELECT "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT 1  [["id", "4"]]
---
  def update
    @table = Table.find(params[:id])

SELECT "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "tables" WHERE "tables"."id" = $1  [["id", 1]]
---
  def destroy
    @table = Table.find(params[:id])
    @table.destroy